      ******************************************************************
      * Author: NACHO.
      * Date: 2025/01/17, 14:06, SANSCRICIA LOCAL TIME. CLOUDY
      * AFTERNOON
      * Purpose: PORTFOLIO.
      * Tectonics: cobc
      * Security:
      * Remarks:
      ******************************************************************
       IDENTIFICATION DIVISION.
       FUNCTION-ID. CELS-TO-KLV.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-CELSIUS-TEMP   PIC S9 ANY NUMERIC.
       01 LN-RETURN-KLV-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-CELSIUS-TEMP
       RETURNING LN-RETURN-KLV-TEMP.

       MAIN-PAR.

           ADD 273.15 TO LN-INPUT-CELSIUS-TEMP
           GIVING LN-RETURN-KLV-TEMP
           END-ADD

           EXIT FUNCTION.

       END FUNCTION CELS-TO-KLV.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. CELS-TO-FAHR.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-CELSIUS-TEMP   PIC S9 ANY NUMERIC.
       01 LN-RETURN-FAHR-TEMP     PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-CELSIUS-TEMP
       RETURNING LN-RETURN-FAHR-TEMP.

       MAIN-PAR.

           COMPUTE LN-RETURN-FAHR-TEMP =
           ((9/5) * LN-INPUT-CELSIUS-TEMP)
           + 32
           END-COMPUTE

           EXIT FUNCTION.

       END FUNCTION CELS-TO-FAHR.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. CELS-TO-RNK.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION CELS-TO-FAHR
           FUNCTION ALL INTRINSIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LOCAL-STORAGE SECTION.
       01 LS-FAHR-TEMP            PIC S9(25)V9(13).
       LINKAGE SECTION.
       01 LN-INPUT-CELSIUS-TEMP   PIC S9 ANY NUMERIC.
       01 LN-RETURN-RNK-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-CELSIUS-TEMP
       RETURNING LN-RETURN-RNK-TEMP.

       MAIN-PAR.

           MOVE CELS-TO-FAHR (LN-INPUT-CELSIUS-TEMP)
           TO   LS-FAHR-TEMP

           ADD 459.67 TO LS-FAHR-TEMP GIVING LN-RETURN-RNK-TEMP
           END-ADD

           EXIT FUNCTION.

       END FUNCTION CELS-TO-RNK.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. KLV-TO-CELS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-KLV-TEMP        PIC S9 ANY NUMERIC.
       01 LN-RETURN-CELS-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-KLV-TEMP
       RETURNING LN-RETURN-CELS-TEMP.

       MAIN-PAR.

           SUBTRACT 273.15 FROM LN-INPUT-KLV-TEMP
           GIVING LN-RETURN-CELS-TEMP
           END-SUBTRACT

           EXIT FUNCTION.

       END FUNCTION KLV-TO-CELS.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. KELV-TO-FAHR.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION KLV-TO-CELS
           FUNCTION CELS-TO-FAHR
           FUNCTION ALL INTRINSIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-KELV-TEMP       PIC S9 ANY NUMERIC.
       01 LN-RETURN-FAHR-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-KELV-TEMP
       RETURNING LN-RETURN-FAHR-TEMP.

       MAIN-PAR.

           MOVE
           CELS-TO-FAHR (KLV-TO-CELS (LN-INPUT-KELV-TEMP))
           TO   LN-RETURN-FAHR-TEMP

           EXIT FUNCTION.

       END FUNCTION KELV-TO-FAHR.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. KELV-TO-RNK.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-KELV-TEMP      PIC S9 ANY NUMERIC.
       01 LN-RETURN-RNK-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-KELV-TEMP
       RETURNING LN-RETURN-RNK-TEMP.

       MAIN-PAR.

           MULTIPLY 1.8 BY LN-INPUT-KELV-TEMP
           GIVING   LN-RETURN-RNK-TEMP
           END-MULTIPLY

           EXIT FUNCTION.

       END FUNCTION KELV-TO-RNK.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. FAHR-TO-CELS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-FAHR-TEMP      PIC S9 ANY NUMERIC.
       01 LN-RETURN-CELS-TEMP     PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-FAHR-TEMP
       RETURNING LN-RETURN-CELS-TEMP.

       MAIN-PAR.

           COMPUTE LN-RETURN-CELS-TEMP =
           (LN-INPUT-FAHR-TEMP - 32)
           * (5/9)
           END-COMPUTE

           EXIT FUNCTION.

       END FUNCTION FAHR-TO-CELS.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. FAHR-TO-KLV.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-FAHR-TEMP     PIC S9 ANY NUMERIC.
       01 LN-RETURN-KLV-TEMP     PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-FAHR-TEMP
       RETURNING LN-RETURN-KLV-TEMP.

       MAIN-PAR.

           COMPUTE LN-RETURN-KLV-TEMP =
           (459.67 + LN-INPUT-FAHR-TEMP)
           * (5/9)
           END-COMPUTE

           EXIT FUNCTION.

       END FUNCTION FAHR-TO-KLV.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. FAHR-TO-RNK.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-FAHR-TEMP     PIC S9 ANY NUMERIC.
       01 LN-RETURN-RNK-TEMP     PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-FAHR-TEMP
       RETURNING LN-RETURN-RNK-TEMP.

       MAIN-PAR.

           ADD 459.67 TO LN-INPUT-FAHR-TEMP
           GIVING LN-RETURN-RNK-TEMP
           END-ADD

           EXIT FUNCTION.

       END FUNCTION FAHR-TO-RNK.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. RNK-TO-CELS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-RNK-TEMP        PIC S9 ANY NUMERIC.
       01 LN-RETURN-CELS-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-RNK-TEMP
       RETURNING LN-RETURN-CELS-TEMP.

       MAIN-PAR.

           COMPUTE LN-RETURN-CELS-TEMP =
           ((5/9)* LN-INPUT-RNK-TEMP)
           - 273.15
           END-COMPUTE

           EXIT FUNCTION.

       END FUNCTION RNK-TO-CELS.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. RNK-TO-KLV.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-RNK-TEMP       PIC S9 ANY NUMERIC.
       01 LN-RETURN-KLV-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-RNK-TEMP
       RETURNING LN-RETURN-KLV-TEMP.

       MAIN-PAR.

           COMPUTE LN-RETURN-KLV-TEMP =
           LN-INPUT-RNK-TEMP * (5/9)
           END-COMPUTE

           EXIT FUNCTION.

       END FUNCTION RNK-TO-KLV.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. RNK-TO-FAHR.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-RNK-TEMP        PIC S9 ANY NUMERIC.
       01 LN-RETURN-FAHR-TEMP      PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-RNK-TEMP
       RETURNING LN-RETURN-FAHR-TEMP.

       MAIN-PAR.

           SUBTRACT 459.67 FROM LN-INPUT-RNK-TEMP
           GIVING   LN-RETURN-FAHR-TEMP
           END-SUBTRACT

           EXIT FUNCTION.

       END FUNCTION RNK-TO-FAHR.



       IDENTIFICATION DIVISION.
       FUNCTION-ID. TEMP-CONV.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
           FUNCTION CELS-TO-KLV
           FUNCTION CELS-TO-FAHR
           FUNCTION CELS-TO-RNK
           FUNCTION KLV-TO-CELS
           FUNCTION KELV-TO-FAHR
           FUNCTION KELV-TO-RNK
           FUNCTION FAHR-TO-CELS
           FUNCTION FAHR-TO-KLV
           FUNCTION FAHR-TO-RNK
           FUNCTION RNK-TO-CELS
           FUNCTION RNK-TO-KLV
           FUNCTION RNK-TO-FAHR
           FUNCTION ALL INTRINSIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LOCAL-STORAGE SECTION.
       LINKAGE SECTION.
       01 LN-INPUT-TEMP              PIC S9 ANY NUMERIC.
       01 LN-INPUT-SCALE             PIC X.

       01 LN-RETURN-VAR.
           05 LN-RETURN-CELS-TEMP    PIC S9(25)V9(13).
           05 LN-RETURN-KELV-TEMP    PIC S9(25)V9(13).
           05 LN-RETURN-FAHR-TEMP    PIC S9(25)V9(13).
           05 LN-RETURN-RNK-TEMP     PIC S9(25)V9(13).

       PROCEDURE DIVISION
       USING LN-INPUT-TEMP, LN-INPUT-SCALE
       RETURNING LN-RETURN-VAR.

           MAIN-PAR.

           EVALUATE TRUE

           WHEN LN-INPUT-SCALE = "C" OR "c"

               MOVE LN-INPUT-TEMP TO LN-RETURN-CELS-TEMP

               MOVE CELS-TO-KLV (LN-INPUT-TEMP)
               TO   LN-RETURN-KELV-TEMP

               MOVE CELS-TO-FAHR (LN-INPUT-TEMP)
               TO   LN-RETURN-FAHR-TEMP

               MOVE CELS-TO-RNK (LN-INPUT-TEMP)
               TO   LN-RETURN-RNK-TEMP

           WHEN LN-INPUT-SCALE = "K" OR "k"

               MOVE LN-INPUT-TEMP TO LN-RETURN-KELV-TEMP

               MOVE KLV-TO-CELS (LN-INPUT-TEMP)
               TO   LN-RETURN-CELS-TEMP

               MOVE KELV-TO-FAHR (LN-INPUT-TEMP)
               TO   LN-RETURN-FAHR-TEMP

               MOVE KELV-TO-RNK (LN-INPUT-TEMP)
               TO   LN-RETURN-RNK-TEMP

           WHEN LN-INPUT-SCALE = "F" OR "f"

               MOVE LN-INPUT-TEMP TO LN-RETURN-FAHR-TEMP

               MOVE FAHR-TO-CELS (LN-INPUT-TEMP)
               TO   LN-RETURN-CELS-TEMP

               MOVE FAHR-TO-KLV (LN-INPUT-TEMP)
               TO   LN-RETURN-KELV-TEMP

               MOVE FAHR-TO-RNK (LN-INPUT-TEMP)
               TO   LN-RETURN-RNK-TEMP

           WHEN LN-INPUT-SCALE = "R" OR "r"

               MOVE LN-INPUT-TEMP TO LN-RETURN-RNK-TEMP

               MOVE RNK-TO-CELS (LN-INPUT-TEMP)
               TO   LN-RETURN-CELS-TEMP

               MOVE RNK-TO-KLV (LN-INPUT-TEMP)
               TO   LN-RETURN-KELV-TEMP

               MOVE RNK-TO-FAHR (LN-INPUT-TEMP)
               TO   LN-RETURN-FAHR-TEMP

           WHEN OTHER

               MOVE "0" TO LN-RETURN-VAR

           END-EVALUATE

           EXIT FUNCTION.

       END FUNCTION TEMP-CONV.

      * B"H.
